ec2-galera/galera-standalone/add_2_120.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 1 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            16772
        write:                           5990
        other:                           2396
        total:                           25158
    transactions:                        1198   (9.98 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 22762  (189.56 per sec.)
    other operations:                    2396   (19.95 per sec.)

Test execution summary:
    total time:                          120.0763s
    total number of events:              1198
    total time taken by event execution: 240.1388
    per-request statistics:
         min:                                 22.03ms
         avg:                                200.45ms
         max:                                698.95ms
         approx.  95 percentile:             349.17ms

Threads fairness:
    events (avg/stddev):           599.0000/6.00
    execution time (avg/stddev):   120.0694/0.00