ec2-galera/galera-standalone/add_2_2280.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 1 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            496762
        write:                           177415
        other:                           70966
        total:                           745143
    transactions:                        35483  (15.56 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 674177 (295.68 per sec.)
    other operations:                    70966  (31.12 per sec.)

Test execution summary:
    total time:                          2280.0546s
    total number of events:              35483
    total time taken by event execution: 4559.6895
    per-request statistics:
         min:                                 16.15ms
         avg:                                128.50ms
         max:                               1126.06ms
         approx.  95 percentile:             254.31ms

Threads fairness:
    events (avg/stddev):           17741.5000/50.50
    execution time (avg/stddev):   2279.8448/0.02